РасширениеГТС/Джитиис/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ASP_ВидКП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ASP_ВидыКП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

РасширениеГТС/Джитиис/Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура асп_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ПолеВвода = Элементы.Добавить(
		"ASP_ВидКП",    
		Тип("ПолеФормы"), 
		Элементы.ГруппаНаименование);
		
	ПолеВвода.Заголовок = "Вид КП";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	
	ПолеВвода.ПутьКДанным = "Объект.ASP_ВидКП";
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиРеквизитов()
	//ASP_Crow 11.03.2026 000029567 В расширение
	
	СтруктураПоиска = Новый Структура("Свойство");
	
	Если ТаблицаНастроекРеквизитов.Количество() > 0 Тогда
		
		Для Каждого Строка Из ТаблицаНастроекРеквизитов Цикл
			Если Не Строка.ЗаполнятьОбязательно
				И Не Строка.Уникален Тогда
				Продолжить;
			КонецЕсли;
			 
			Если Строка.ЭтоДопРеквизит Тогда
				
				Если НЕ ИспользоватьДополнительныеРеквизитыИСведения Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураПоиска.Свойство = Строка.Свойство;
				
				НайденныеСтроки = ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(СтруктураПоиска);
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяЭлементаФормы = НайденныеСтроки[0].ИмяРеквизитаЗначение;
				
			Иначе
				
				ИмяЭлементаФормы = Строка.ИмяРеквизита;
				
			КонецЕсли;
			
			Если Элементы.Найти(ИмяЭлементаФормы) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Элемент = Элементы[ИмяЭлементаФормы];
			
			Если Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
				Элементы[ИмяЭлементаФормы].АвтоОтметкаНезаполненного = Ложь;
				Элементы[ИмяЭлементаФормы].ОтметкаНезаполненного     = Ложь;
				
				Элемент.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаРеквизитов = Справочники.Номенклатура.ТаблицаНастроекРеквизитов(Объект.ВидНоменклатуры,
																			Объект.ТипНоменклатуры,
																			Объект.ОсобенностьУчета,
																			Объект.ИспользованиеХарактеристик,
																			РеквизитыВидаНоменклатуры.ИспользоватьСрокГодностиСерии,
																			"Номенклатура");
	
	ТаблицаНастроекРеквизитов.Загрузить(ТаблицаРеквизитов);
	
	Справочники.Номенклатура.НастроитьФормуПоТаблицеНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАктивностьПослеСворачиванияРазворачиванияГруппы() 
	//ASP_Crow 11.03.2026 000029567 В расширение
	Если Элементы["ДекорацияОткрыть" + ИмяГруппыСвернутьРазвернуть].Видимость Тогда
		ТекущийЭлемент = Элементы["ДекорацияОткрыть" + ИмяГруппыСвернутьРазвернуть];
	Иначе
		ТекущийЭлемент = Элементы["ДекорацияЗакрыть" + ИмяГруппыСвернутьРазвернуть];
	КонецЕсли;
КонецПроцедуры
